:PROPERTIES:
:ID:       f58465bf-212c-469b-aab3-4a54eafee50c
:END:
#+TITLE: Tchebycheff inequality
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope file :emphasize nil
#+CAPTION: Clock summary at [2024-04-14 Sun 05:51]
| Headline                   | Time   |
|----------------------------+--------|
| *Total time*               | *0:17* |
|----------------------------+--------|
| 2.3 Tchebycheff inequality | 0:17   |
#+END
* 2.3 Tchebycheff inequality
:LOGBOOK:
CLOCK: [2024-04-12 Fri 18:22]--[2024-04-12 Fri 18:39] =>  0:17
:END:
*Consider any probability density* \( p(x) \) *for* \( (-\infty < x < \infty) \), *with mean* \( \lambda \), *and variance* \( \sigma^2 \). *Show that the total probability of outcomes that are more than* \( n\sigma \) *away from* \( \lambda \) *is less than* \( 1/n^2 \), *that is,*

\[ \int_{|x-\lambda|\geq n\sigma} dx\, p(x) \leq \frac{1}{n^2}. \]

*Hint: Start with the integral defining* \( \sigma^2 \), *and break it up into parts corresponding to* \( |x - \lambda| > n\sigma \) *and* \( |x - \lambda| < n\sigma \).

\begin{align*}
\int_{-\infty}^{\infty}(x-\lambda)^2 & p(x) \,dx = \sigma^2 \\
&\Rightarrow \int_{n \sigma \leqslant|x-\lambda|}(x-\lambda)^2 \, p(x) \,dx \leqslant \sigma^2 \\
&\Rightarrow \int_{n \sigma \leqslant|x-\lambda|}(n \sigma)^2 \,p(x) \,dx \leqslant \sigma^2 \\
&\Rightarrow \int_{n \sigma \leqslant|x-\lambda|} \,p(x) \,dx \leqslant \frac{1}{n^2} \qquad n \neq 0.
\end{align*}

Note that \(n \leqslant 1\) is trivially true. Tchebycheff's inequality dictates bounds for an integral beyond the distance \(n\sigma\) from the mean for /any/ arbitrary PDF. In fact, /any/ even cumulant will do, you need not stick to the variance

\begin{aligned}
\int_{\lvert x-\lambda \rvert \geqslant l} \, p(x) \,dx \leqslant \frac{\left\langle x^m\right\rangle_c}{l^m}, \quad m=2 n, \qquad n=1,\,2,\,3, \ldots.
\end{aligned}



